function[] = fDraw_Graph3(FH,G,V,F,color)

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%   MFPの描画
%
%   [] = fDraw_MFP3(FH,G,V,F, color)
%       FH: Figure Handle
%       G : グラフ
%       V : 頂点データ
%       F : 描画フラグ　2:2D 3:3D
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%
% clear all
% 
% disp('test data')
% FH = 1;
% figure(FH)
% clf(FH)
% rotate3d
% 
% G = [0     1     1     0     1     0     0     0
%      1     0     0     1     0     1     0     0
%      1     0     0     1     0     0     1     0
%      0     1     1     0     0     0     0     1
%      1     0     0     0     0     1     1     0
%      0     1     0     0     1     0     0     1
%      0     0     1     0     1     0     0     1
%      0     0     0     1     0     1     1     0];
% 
% V = [0.9000    0.9000    0.9000    0.9000   -0.9000   -0.9000   -0.9000   -0.9000
%      0.5500    0.5500   -0.5500   -0.5500    0.5500    0.5500   -0.5500   -0.5500
%      0.3050   -0.3050    0.3050   -0.3050    0.3050   -0.3050    0.3050   -0.3050];
% 
% Vt = [1; 0; 0];
% for i = 1:3
% for j = 1:size(V,2)
%     V(i,j) = V(i,j) + Vt(i);
% end
% end
% 
% color = 'b';
% 
% F = 3;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

n = [0;0;1];
a = 0;
na = a*n;

figure(FH)
hold on
rotate3d

cnt = 0;
Vc = nan(3,sum(sum(G))/2);
for i = 1:size(G,2)
    for j = i+1:size(G,2)
        if G(i,j) == 1
            if F==2 || F==23 || F==32
                t = dot(n,na-V(:,i)) / dot(n,V(:,j)-V(:,i));
                if t >=0 && t <=1
                    cnt = cnt+1;
                    Vc(:,cnt) = V(:,i)+(V(:,j)-V(:,i))*t;
                end
            end
            if F==3 || F==32 || F==23
                plot3([V(1,i),V(1,j)],[V(2,i),V(2,j)],[V(3,i),V(3,j)],color);
            end
        end
    end
end

if F==2 || F==23 || F==32
    disp('とりあえず平面凸包を使用')
    k = convhull(Vc(1,1:cnt)',Vc(2,1:cnt)');
    plot(Vc(1,k),Vc(2,k),color);
end

axis equal
